#+TITLE: Polar catalog service
#+OPTIONS: num:t
*** Local K8s cluster using minikube

- Stop the default minikube cluster
#+begin_src sh
minikube stop
#+end_src

#+RESULTS:
| ✋ | Stopping | node | polar    | ... |
| 🛑 |        1 | node | stopped. |     |

- We can create a separate profile for Polar on top of docker.

#+begin_src sh
minikube start --cpus 2 --memory 4g --driver docker --profile polar
#+end_src

- Get nodes
  #+begin_src sh
kubectl get nodes
  #+end_src

  #+RESULTS:
  | NAME  | STATUS | ROLES         | AGE | VERSION |
  | polar | Ready  | control-plane | 34m | v1.31.0 |

- Ensure current context is polar
  #+begin_src sh
#kubectl config get-contexts
kubectl config current-context
  #+end_src

  #+RESULTS:
  : polar

- To change context
  #+begin_src sh
kubectl config use-context polar
  #+end_src

  #+RESULTS:
  : Switched to context "polar".

- Start, stop and delete cluster
  #+begin_src sh
#minikube stop --profile polar
#minikube start --profile polar
#minikube delete --profile polar
  #+end_src

